<?php

namespace Database\Seeders;

use App\Models\Category;
use Illuminate\Database\Seeder;

class CategorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $categories = [
            [
                'name' => '100806500',
                'title' => '10051001. автобусы'
            ],
            [
                'name' => '100806501',
                'title' => '10051002. автозапчасти'
            ],
            [
                'name' => '100806502',
                'title' => '10051003. акции'
            ],
            [
                'name' => '100806503',
                'title' => '10051004. алкогольная продукция'
            ],
            [
                'name' => '100806504',
                'title' => '10051005. бензин'
            ],
            [
                'name' => '100806505',
                'title' => '10051006. бензопилы'
            ],
            [
                'name' => '100806506',
                'title' => '10051007. бытовая техника'
            ],
            [
                'name' => '100806507',
                'title' => '10051008. бытовая химия'
            ],
            [
                'name' => '100806508',
                'title' => '10051009. гаражи'
            ],
            [
                'name' => '100806509',
                'title' => '10051010. грузовые автомобили'
            ],
            [
                'name' => '100806510',
                'title' => '10051011. диски DVD'
            ],
            [
                'name' => '100806511',
                'title' => '10051012. домашний скот'
            ],
            [
                'name' => '100806512',
                'title' => '10051013. дорожная техника'
            ],
            [
                'name' => '100806513',
                'title' => '10051014. драгоценные металлы, драгоценные камни и изделия из них'
            ],
            [
                'name' => '100806514',
                'title' => '10051016. ёмкость'
            ],
            [
                'name' => '100806515',
                'title' => '10051017. жилые помещения'
            ],
            [
                'name' => '100806516',
                'title' => '10051018. здания и сооружения'
            ],
            [
                'name' => '100806517',
                'title' => '10051019. земельные участки'
            ],
            [
                'name' => '100806518',
                'title' => '10051020. зерно и семена'
            ],
            [
                'name' => '100806519',
                'title' => '10051021. изделия медецинского назначения и медтехника'
            ],
            [
                'name' => '100806520',
                'title' => '10051022. инструменты и стройматериалы'
            ],
            [
                'name' => '100806521',
                'title' => '10051023. компьютеры и оргтехника'
            ],
            [
                'name' => '100806522',
                'title' => '10051024. кухонная утварь, посуда'
            ],
            [
                'name' => '100806523',
                'title' => '10051025. легковые автомобили'
            ],
            [
                'name' => '100806524',
                'title' => '10051026. лом черного и цветного металла'
            ],
            [
                'name' => '100806525',
                'title' => '10051027. мебель'
            ],
            [
                'name' => '100806526',
                'title' => '10051028. металлоконструкции'
            ],
            [
                'name' => '100806527',
                'title' => '10051029. морские биологические ресурсы'
            ],
            [
                'name' => '100806528',
                'title' => '10051030. музыкальные инструменты'
            ],
            [
                'name' => '100806529',
                'title' => '10051031. оборудование шиномонтажа'
            ],
            [
                'name' => '100806530',
                'title' => '10051032. одежда и обувь'
            ],
            [
                'name' => '100806531',
                'title' => '10051033. орудия лова'
            ],
            [
                'name' => '100806532',
                'title' => '10051035. офисное оборудование'
            ],
            [
                'name' => '100806533',
                'title' => '10051036. парфюмерия и косметические средства'
            ],
            [
                'name' => '100806534',
                'title' => '10051037. морские суда'
            ],
            [
                'name' => '100806535',
                'title' => '10051038. суда внутреннего плавания'
            ],
            [
                'name' => '100806536',
                'title' => '10051039. права аренды'
            ],
            [
                'name' => '100806537',
                'title' => '10051040. нежилые помещения'
            ],
            [
                'name' => '100806538',
                'title' => '10051041. дебиторская задолженность'
            ],
            [
                'name' => '100806539',
                'title' => '10051042. предметы декора'
            ],
            [
                'name' => '100806540',
                'title' => '10051043. приборы измерения массы'
            ],
            [
                'name' => '100806541',
                'title' => '10051044. приборы измерения времени'
            ],
            [
                'name' => '100806542',
                'title' => '10051045. продукты питания долгого хранения'
            ],
            [
                'name' => '100806543',
                'title' => '10051046. продукты питания скоропортящиеся'
            ],
            [
                'name' => '100806544',
                'title' => '10051047. продукция лесозаготовительной и лесопильно-деревообрабатывающей промышленности'
            ],
            [
                'name' => '100806545',
                'title' => '10051048. производственное оборудование'
            ],
            [
                'name' => '100806546',
                'title' => '10051049. промышленное оборудование'
            ],
            [
                'name' => '100806547',
                'title' => '10051050. прочая недвижимость'
            ],
            [
                'name' => '100806548',
                'title' => '10051051. прочие категории имущества'
            ],
            [
                'name' => '100806549',
                'title' => '10051052. прочие нефтепродукты'
            ],
            [
                'name' => '100806550',
                'title' => '10051053. прочие транспортные средства, номерные агрегаты и запчасти к ним'
            ],
            [
                'name' => '100806551',
                'title' => '10051054. прочие ценные бумаги'
            ],
            [
                'name' => '100806552',
                'title' => '10051055. речные биологические ресурсы'
            ],
            [
                'name' => '100806553',
                'title' => '10051056. сельхоз продукция'
            ],
            [
                'name' => '100806554',
                'title' => '10051057. сельхоз техника'
            ],
            [
                'name' => '100806555',
                'title' => '10051058. спиртосодержащая продукция'
            ],
            [
                'name' => '100806556',
                'title' => '10051059. станки различного назначения'
            ],
            [
                'name' => '100806557',
                'title' => '10051060. строительные материалы'
            ],
            [
                'name' => '100806558',
                'title' => '10051061. сувениры'
            ],
            [
                'name' => '100806559',
                'title' => '10051062. табак и промышленные заменители табака'
            ],
            [
                'name' => '100806560',
                'title' => '10051063. телевизионная, аудио-видео техника'
            ],
            [
                'name' => '100806561',
                'title' => '10051064. телефонные аппараты'
            ],
            [
                'name' => '100806562',
                'title' => '10051065. товары народного потребления'
            ],
            [
                'name' => '100806563',
                'title' => '10051066. торговое оборудование'
            ],
            [
                'name' => '100806564',
                'title' => '10051067. тракторная техника'
            ],
            [
                'name' => '100806565',
                'title' => '10051068. уголь каменный'
            ],
            [
                'name' => '100806566',
                'title' => '10051069. фото видео камеры'
            ],
            [
                'name' => '100806567',
                'title' => '10051070. хлебные злаки'
            ],
            [
                'name' => '100806568',
                'title' => '10051071. холодильное оборудование'
            ],
            [
                'name' => '100806569',
                'title' => '10051072. электрическая энергия'
            ],
            [
                'name' => '100806570',
                'title' => '10051073. электрооборудование'
            ],
            [
                'name' => '100806571',
                'title' => '10051074. квартира'
            ],
            [
                'name' => '100806572',
                'title' => '10051075. жилой дом'
            ],
            [
                'name' => '100806573',
                'title' => '10051076. жилой комплекс'
            ],
            [
                'name' => '100806574',
                'title' => '10051077. промышленный комплекс'
            ],
            [
                'name' => '100806575',
                'title' => '10051078. коммерческая недвижимость'
            ]
        ];

        $insert = [];
        foreach ($categories as $category) {
            $parts = explode('.', $category['title']);
            $insert[] = [
                'code' => $category['name'],
                'name_kk' => trim($parts[1]),
                'name_ru' => trim($parts[1]),
            ];
        }
        if(!Category::exists()) {
            Category::insert($insert);
        }
    }
}
