<?php

namespace Database\Seeders;

use App\Models\Region;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class RegionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        if (!Region::exists()) {
            collect([
                [
                    'code' => '100806670',
                    'name_kk' => 'Астана қ.',
                    'name_ru' => 'г. Астана',
                ],
                [
                    'code' => '100806669',
                    'name_kk' => 'Алматы қ.',
                    'name_ru' => 'г. Алматы',
                ],
                [
                    'code' => '100806634',
                    'name_kk' => 'Шымкент қ.',
                    'name_ru' => 'г. Шымкент',
                ],
                [
                    'code' => '100806577',
                    'name_kk' => 'Қарағанды облысы',
                    'name_ru' => 'Карагандинская область',
                ],
                [
                    'code' => '100806578',
                    'name_kk' => 'Шығыс Қазақстан облысы',
                    'name_ru' => 'Восточно-Казахстанская область',
                ],
                [
                    'code' => '100806579',
                    'name_kk' => 'Алматы облысы',
                    'name_ru' => 'Алматинская область',
                ],
                [
                    'code' => '100806580',
                    'name_kk' => 'Жамбыл облысы',
                    'name_ru' => 'Жамбылская область',
                ],
                [
                    'code' => '100806581',
                    'name_kk' => 'Түркістан облысы',
                    'name_ru' => 'Туркестанская область',
                ],
                [
                    'code' => '100806582',
                    'name_kk' => 'Қызылорда облысы',
                    'name_ru' => 'Кызылординская область',
                ],
                [
                    'code' => '100806583',
                    'name_kk' => 'Ақтөбе облысы',
                    'name_ru' => 'Актюбинская область',
                ],
                [
                    'code' => '100806584',
                    'name_kk' => 'Қостанай облысы',
                    'name_ru' => 'Костанайская область',
                ],
                [
                    'code' => '100806585',
                    'name_kk' => 'Солтүстік Қазақстан облысы',
                    'name_ru' => 'Северо-Казахстанская область',
                ],
                [
                    'code' => '100806586',
                    'name_kk' => 'Ақмола облысы',
                    'name_ru' => 'Акмолинская область',
                ],
                [
                    'code' => '100806587',
                    'name_kk' => 'Павлодар облысы',
                    'name_ru' => 'Павлодарская область',
                ],
                [
                    'code' => '100806588',
                    'name_kk' => 'Батыс Қазақстан облысы',
                    'name_ru' => 'Западно-Казахстанская область',
                ],
                [
                    'code' => '100806589',
                    'name_kk' => 'Атырау облысы',
                    'name_ru' => 'Атырауская область',
                ],
                [
                    'code' => '100806590',
                    'name_kk' => 'Маңғыстау облысы',
                    'name_ru' => 'Мангистауская область',
                ],
                [
                    'code' => '106210303',
                    'name_kk' => 'Ұлытау облысы',
                    'name_ru' => 'Область Ұлытау',
                ],
                [
                    'code' => '106210304',
                    'name_kk' => 'Абай облысы',
                    'name_ru' => 'Область Абай',
                ],
                [
                    'code' => '106210388',
                    'name_kk' => 'Жетісу облысы',
                    'name_ru' => 'Область Жетісу',
                ],
            ])->each(function ($region) {
                Region::create($region);
            });
        }
    }
}
